# St7SetEntityGroup

Assigns the specified entity to a given group.

long St7SetEntityGroup(long uID, long Entity, long EntityNum, long GroupID)
Input Parameters
uID
Strand7 model file ID.
Entity
One of tyBEAM, tyPLATE, tyBRICK, tyLINK, tyGEOMETRYFACE or tyLOADPATH.
EntityNum
Entity number.
GroupID
Group ID.